import { useScrollTop } from "../../hooks/top-scroll"
import avatar from '../../assets/avatar_img.svg'
import { NavLink, Outlet } from "react-router-dom"

export const MainProfile = () => {
    useScrollTop()
    return (
        <div className="container">
            <div>

                {/*profile-up */}
                <div className="flex items-center gap-8 rounded-sm shadow-[0_4px_4px_0_rgba(0,0,0,0.06)]">
                    <img src={avatar} alt="avatar" className="p-6" />
                    <div>
                        <h2 className="font-bold text-[30px]">Суғдиёна Икромова</h2>
                        <p className="text-[20px] mt-2.5">+998 90 253 77 53</p>
                        <p className="font-medium text-[20px] text-[#9A9A9A] mt-2.5">ID: 0001  Баланс: 45 000 сўм</p>
                    </div>
                </div>

                {/* profile-down */}
                <div className="mt-[60px] mb-25 inline-flex rounded-md">

                    {/* lafet-layout */}
                    <div className="shadow-[0_4px_4px_0_rgba(0,0,0,0.06)] p-9 flex flex-col gap-3">

                        <NavLink to={'follow'}>
                            <div className="flex gap-2 text-[#3F51B5] items-center">
                                <span>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M12.8971 21.968C12.366 21.9696 11.8565 21.7586 11.4821 21.382L3.64805 13.547C3.23464 13.1348 3.02266 12.5621 3.06805 11.98L3.56805 5.41401C3.63935 4.4264 4.42625 3.64163 5.41405 3.57301L11.9801 3.07301C12.0311 3.06201 12.0831 3.06201 12.1341 3.06201C12.6639 3.06337 13.1718 3.27399 13.5471 3.64801L21.3821 11.482C21.7573 11.8571 21.9681 12.3659 21.9681 12.8965C21.9681 13.4271 21.7573 13.9359 21.3821 14.311L14.3111 21.382C13.9369 21.7583 13.4277 21.9693 12.8971 21.968ZM12.1331 5.06201L5.56205 5.56201L5.06205 12.133L12.8971 19.968L19.9671 12.898L12.1331 5.06201ZM8.65405 10.654C7.69989 10.6542 6.87847 9.98037 6.69213 9.04458C6.5058 8.10879 7.00646 7.17169 7.88792 6.80639C8.76939 6.44109 9.78615 6.74933 10.3164 7.54259C10.8466 8.33586 10.7426 9.39322 10.0681 10.068C9.69388 10.4443 9.18473 10.6553 8.65405 10.654Z" fill="#3F51B5" />
                                    </svg>
                                </span>
                                <p className="font-bold">Обуна бўлиш</p>
                            </div>
                        </NavLink>

                        <NavLink to={'e-balance'}>
                            <div className="flex gap-2 items-center">
                                <span>
                                    <svg width="19" height="18" viewBox="0 0 19 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M18 4.28V2C18 0.9 17.1 0 16 0H2C0.89 0 0 0.9 0 2V16C0 17.1 0.89 18 2 18H16C17.1 18 18 17.1 18 16V13.72C18.59 13.37 19 12.74 19 12V6C19 5.26 18.59 4.63 18 4.28ZM17 6V12H10V6H17ZM2 16V2H16V4H10C8.9 4 8 4.9 8 6V12C8 13.1 8.9 14 10 14H16V16H2Z" fill="#3F51B5" />
                                        <path d="M13 10.5C13.8284 10.5 14.5 9.82843 14.5 9C14.5 8.17157 13.8284 7.5 13 7.5C12.1716 7.5 11.5 8.17157 11.5 9C11.5 9.82843 12.1716 10.5 13 10.5Z" fill="#3F51B5" />
                                    </svg>
                                </span>
                                <p className="font-medium">Э-Хисоб</p>
                            </div>
                        </NavLink>

                        <NavLink to={'books'}>
                            <div className="flex gap-2 items-center">
                                <span>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <g clip-path="url(#clip0_1091_7156)">
                                            <path d="M3 18.5V5C3 4.20435 3.31607 3.44129 3.87868 2.87868C4.44129 2.31607 5.20435 2 6 2H20C20.2652 2 20.5196 2.10536 20.7071 2.29289C20.8946 2.48043 21 2.73478 21 3V21C21 21.2652 20.8946 21.5196 20.7071 21.7071C20.5196 21.8946 20.2652 22 20 22H6.5C5.57174 22 4.6815 21.6313 4.02513 20.9749C3.36875 20.3185 3 19.4283 3 18.5ZM19 20V17H6.5C6.10218 17 5.72064 17.158 5.43934 17.4393C5.15804 17.7206 5 18.1022 5 18.5C5 18.8978 5.15804 19.2794 5.43934 19.5607C5.72064 19.842 6.10218 20 6.5 20H19ZM10 4H6C5.73478 4 5.48043 4.10536 5.29289 4.29289C5.10536 4.48043 5 4.73478 5 5V15.337C5.46869 15.1144 5.98115 14.9993 6.5 15H19V4H17V12L13.5 10L10 12V4Z" fill="#3F51B5" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_1091_7156">
                                                <rect width="24" height="24" fill="white" />
                                            </clipPath>
                                        </defs>
                                    </svg>
                                </span>
                                <p className="font-medium">Китобларим</p>
                            </div>
                        </NavLink>

                        <NavLink to={'save'}>
                            <div className="flex gap-2 items-center">
                                <span>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <g clip-path="url(#clip0_1091_7159)">
                                            <path d="M5 2H19C19.2652 2 19.5196 2.10536 19.7071 2.29289C19.8946 2.48043 20 2.73478 20 3V22.143C20.0001 22.2324 19.9763 22.3202 19.9309 22.3973C19.8855 22.4743 19.8204 22.5378 19.7421 22.5811C19.6639 22.6244 19.5755 22.6459 19.4861 22.6434C19.3968 22.641 19.3097 22.6146 19.234 22.567L12 18.03L4.766 22.566C4.69037 22.6135 4.60339 22.6399 4.5141 22.6424C4.42482 22.6449 4.33649 22.6235 4.2583 22.5803C4.1801 22.5371 4.11491 22.4738 4.06948 22.3969C4.02406 22.32 4.00007 22.2323 4 22.143V3C4 2.73478 4.10536 2.48043 4.29289 2.29289C4.48043 2.10536 4.73478 2 5 2ZM18 4H6V19.432L12 15.671L18 19.432V4Z" fill="#3F51B5" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_1091_7159">
                                                <rect width="24" height="24" fill="white" />
                                            </clipPath>
                                        </defs>
                                    </svg>
                                </span>
                                <p className="font-medium">Сақланганлар</p>
                            </div>
                        </NavLink>

                        <NavLink to={'settings'}>
                            <div className="flex gap-2 items-center">
                                <span>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M13.82 22H10.18C9.71016 22 9.3036 21.673 9.20304 21.214L8.79604 19.33C8.25309 19.0921 7.73827 18.7946 7.26104 18.443L5.42404 19.028C4.97604 19.1709 4.48903 18.9823 4.25404 18.575L2.43004 15.424C2.19763 15.0165 2.2777 14.5025 2.62304 14.185L4.04804 12.885C3.98324 12.2961 3.98324 11.7019 4.04804 11.113L2.62304 9.816C2.27719 9.49837 2.19709 8.98372 2.43004 8.576L4.25004 5.423C4.48503 5.0157 4.97204 4.82714 5.42004 4.97L7.25704 5.555C7.5011 5.37416 7.75517 5.20722 8.01804 5.055C8.27038 4.91269 8.53008 4.78385 8.79604 4.669L9.20404 2.787C9.30411 2.32797 9.71023 2.00049 10.18 2H13.82C14.2899 2.00049 14.696 2.32797 14.796 2.787L15.208 4.67C15.4888 4.79352 15.7623 4.93308 16.027 5.088C16.274 5.23081 16.5127 5.38739 16.742 5.557L18.58 4.972C19.0277 4.82967 19.5142 5.01816 19.749 5.425L21.569 8.578C21.8015 8.98548 21.7214 9.49951 21.376 9.817L19.951 11.117C20.0158 11.7059 20.0158 12.3001 19.951 12.889L21.376 14.189C21.7214 14.5065 21.8015 15.0205 21.569 15.428L19.749 18.581C19.5142 18.9878 19.0277 19.1763 18.58 19.034L16.742 18.449C16.5095 18.6203 16.2678 18.7789 16.018 18.924C15.7559 19.0759 15.4854 19.2131 15.208 19.335L14.796 21.214C14.6956 21.6726 14.2895 21.9996 13.82 22ZM7.62004 16.229L8.44004 16.829C8.62489 16.9652 8.81755 17.0904 9.01704 17.204C9.20474 17.3127 9.39801 17.4115 9.59604 17.5L10.529 17.909L10.986 20H13.016L13.473 17.908L14.406 17.499C14.8133 17.3194 15.1999 17.0961 15.559 16.833L16.38 16.233L18.421 16.883L19.436 15.125L17.853 13.682L17.965 12.67C18.0142 12.2274 18.0142 11.7806 17.965 11.338L17.853 10.326L19.437 8.88L18.421 7.121L16.38 7.771L15.559 7.171C15.1998 6.90671 14.8133 6.68175 14.406 6.5L13.473 6.091L13.016 4H10.986L10.527 6.092L9.59604 6.5C9.39785 6.58704 9.20456 6.68486 9.01704 6.793C8.81878 6.90633 8.62713 7.03086 8.44304 7.166L7.62204 7.766L5.58204 7.116L4.56504 8.88L6.14804 10.321L6.03604 11.334C5.98684 11.7766 5.98684 12.2234 6.03604 12.666L6.14804 13.678L4.56504 15.121L5.58004 16.879L7.62004 16.229ZM11.996 16C9.7869 16 7.99604 14.2091 7.99604 12C7.99604 9.79086 9.7869 8 11.996 8C14.2052 8 15.996 9.79086 15.996 12C15.9933 14.208 14.204 15.9972 11.996 16ZM11.996 10C10.9034 10.0011 10.0139 10.8788 9.99827 11.9713C9.98262 13.0638 10.8466 13.9667 11.9387 13.9991C13.0309 14.0315 13.9469 13.1815 13.996 12.09V12.49V12C13.996 10.8954 13.1006 10 11.996 10Z" fill="#3F51B5" />
                                    </svg>
                                </span>
                                <p className="font-medium"> Созламалар</p>
                            </div>
                        </NavLink>

                        <NavLink to='dark-light'>
                            <div className="flex gap-2 items-center">
                                <span>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M18.248 16.9971C18.1656 16.9989 18.0829 16.9999 18 16.9999C11.9249 16.9999 7 12.075 7 5.99987C7 5.91697 7.00092 5.83428 7.00275 5.7518C5.17211 7.21839 4 9.47327 4 11.9998C4 16.4181 7.58172 19.9998 12 19.9998C14.5266 19.9998 16.7814 18.8277 18.248 16.9971ZM19.4661 14.881C18.989 14.9592 18.4992 14.9999 18 14.9999C13.0294 14.9999 9 10.9704 9 5.99987C9 5.50062 9.04065 5.01086 9.11882 4.53373C9.25094 3.72732 9.49024 2.95697 9.82162 2.23779C8.96026 2.42915 8.14073 2.73161 7.37882 3.12934C4.18215 4.79809 2 8.14413 2 11.9998C2 17.5227 6.47715 21.9998 12 21.9998C15.8557 21.9998 19.2017 19.8177 20.8705 16.6211C21.2682 15.8592 21.5707 15.0396 21.762 14.1783C21.0429 14.5096 20.2725 14.7489 19.4661 14.881Z" fill="#3F51B5" />
                                    </svg>
                                </span>
                                <p className="font-medium"> Тунги режим</p>
                                <span className="ml-10">
                                    <svg width="37" height="26" viewBox="0 0 37 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <rect x="3" y="5" width="34" height="14" rx="7" fill="#F5F5F5" />
                                        <g filter="url(#filter0_ddd_1089_7850)">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M13 22C18.5228 22 23 17.5228 23 12C23 6.47715 18.5228 2 13 2C7.47715 2 3 6.47715 3 12C3 17.5228 7.47715 22 13 22Z" fill="#F5F5F5" />
                                        </g>
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M13 22C18.5228 22 23 17.5228 23 12C23 6.47715 18.5228 2 13 2C7.47715 2 3 6.47715 3 12C3 17.5228 7.47715 22 13 22Z" fill="white" />
                                        <defs>
                                            <filter id="filter0_ddd_1089_7850" x="0" y="0" width="26" height="26" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                                <feFlood flood-opacity="0" result="BackgroundImageFix" />
                                                <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                                                <feOffset dy="1" />
                                                <feGaussianBlur stdDeviation="1.5" />
                                                <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.2 0" />
                                                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_1089_7850" />
                                                <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                                                <feOffset dy="2" />
                                                <feGaussianBlur stdDeviation="0.5" />
                                                <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.12 0" />
                                                <feBlend mode="normal" in2="effect1_dropShadow_1089_7850" result="effect2_dropShadow_1089_7850" />
                                                <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                                                <feOffset dy="1" />
                                                <feGaussianBlur stdDeviation="0.5" />
                                                <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.14 0" />
                                                <feBlend mode="normal" in2="effect2_dropShadow_1089_7850" result="effect3_dropShadow_1089_7850" />
                                                <feBlend mode="normal" in="SourceGraphic" in2="effect3_dropShadow_1089_7850" result="shape" />
                                            </filter>
                                        </defs>
                                    </svg>
                                </span>
                            </div>
                        </NavLink>

                    </div>

                    <div>
                        <Outlet />
                    </div>

                </div>

            </div>
        </div>
    )
}
